Tekla Open API Reference for Tekla Structures 2025
Frame Constructor
Overload List
Name | Description
Frame(FrameTypes, DrawingColors)
 Creates a new frame instance with the specified frame type and color.
Frame(FrameTypes, TeklaDrawingColor)
 Creates a new frame instance with the specified frame type and RGB color.
Top
See Also
Reference
Frame Class
Tekla.Structures.Drawing Namespace